# Q16 모스 부호 해독
dic = {
    '.-':'A','-...':'B','-.-.':'C','-..':'D','.':'E','..-.':'F',
    '--.':'G','....':'H','..':'I','.---':'J','-.-':'K','.-..':'L',
    '--':'M','-.':'N','---':'O','.--.':'P','--.-':'Q','.-.':'R',
    '...':'S','-':'T','..-':'U','...-':'V','.--':'W','-..-':'X',
    '-.--':'Y','--..':'Z'
}

def morse(src):
    result = []
    for word in src.split("  "):            # 단어 단위로 쪼개기
        for char in word.split(" "):        # 문자 단위로 쪼개서
            result.append(dic[char])        # dic에서 모스부호 해독
        result.append(" ")                  # 한 단어가 끝났으므로 띄어쓰기
    return "".join(result)                  # list 합치기

print(morse('.... .  ... .-.. . . .--. ...  . .- .-. .-.. -.--'))